Repository: J-Wachs/Z21Client
Catalog: Z21Client/Resources/Localization/Messages.*.resx
Languages: da

# Text0001
source: Subscribing to AllLocoInfoReceived event. Adding AllLocoInfo broadcast flag.
da: Tilmelder til AllLocoInfoReceived-hændelse. Tilføjer AllLocoInfo broadcast-flag.

# Text0002
source: Unsubscribing from AllLocoInfoReceived event. Removing AllLocoInfo broadcast flag.
da: Afmelder fra AllLocoInfoReceived-hændelse. Fjerner AllLocoInfo broadcast-flag.

# Text0003
source: Subscribing to RailComDataReceived event. Adding AllRailCom broadcast flag and starting polling.
da: Tilmelder til RailComDataReceived-hændelse. Tilføjer AllRailCom broadcast-flag og starter polling.

# Text0004
source: Unsubscribing from RailComDataReceived event. Removing AllRailCom broadcast flag and stopping polling.
da: Afmelder fra RailComDataReceived-hændelse. Fjerner AllRailCom broadcast-flag og stopper polling.

# Text0005
source: Subscribing to RBusDataReceived event. Adding RBus broadcast flag.
da: Tilmelder til RBusDataReceived-hændelse. Tilføjer RBus broadcast-flag.

# Text0006
source: Unsubscribing from RBusDataReceived event. Removing RBus broadcast flag.
da: Afmelder fra RBusDataReceived-hændelse. Fjerner RBus broadcast-flag.

# Text0007
source: Subscribing to SystemStateChanged event. Adding SystemState broadcast flag.
da: Tilmelder til SystemStateChanged-hændelse. Tilføjer SystemState broadcast-flag.

# Text0008
source: Unsubscribing from SystemStateChanged event. Removing SystemState broadcast flag.
da: Afmelder fra SystemStateChanged-hændelse. Fjerner SystemState broadcast-flag.

# Text0009
source: Connecting to Z21 at {Host}:{Port}...
da: Forbinder til Z21 på {Host}:{Port}...

# Text0010
source: Already connected. Please disconnect first.
da: Allerede forbundet. Frakobl venligst først.

# Text0011
source: Connection failed: Host {Host} is not reachable (ping failed).
da: Forbindelse mislykkedes: Vært {Host} kan ikke nås (ping mislykkedes).

# Text0012
source: Invalid IP address provided: {Host}
da: Ugyldig IP-adresse angivet: {Host}

# Text0013
source: UdpClient created and bound to listen on local port {Port}
da: UdpClient oprettet og bundet til at lytte på lokal port {Port}

# Text0014
source: Failed to create and bind UdpClient on port {Port}. The port may already be in use by another application.
da: Kunne ikke oprette og binde UdpClient på port {Port}. Porten er muligvis allerede i brug af et andet program.

# Text0015
source: Connection failed: Host responded to ping, but did not respond to Z21 command (handshake failed).
da: Forbindelse mislykkedes: Vært svarede på ping, men svarede ikke på Z21-kommando (håndtryk mislykkedes).

# Text0016
source: Z21 client connection verified and fully started.
da: Z21-klientforbindelse verificeret og fuldt startet.

# Text0017
source: Disconnecting from Z21...
da: Frakobler fra Z21...

# Text0018
source: Receive task was successfully cancelled as expected during disconnect.
da: Modtagelses-opgave blev annulleret som forventet under frakobling.

# Text0019
source: Receive task did not cancel within the expected time during disconnect.
da: Modtagelses-opgave blev ikke annulleret inden for den forventede tid under frakobling.

# Text0020
source: Disconnected.
da: Frakoblet.

# Text0021
source: GetLocoInfoAsync: Requested loco info for address {Address}
da: GetLocoInfoAsync: Anmodede om lokomotiv-info for adresse {Address}

# Text0022
source: GetLocoModeAsync: Requested loco mode for address {Address}
da: GetLocoModeAsync: Anmodede om lokomotiv-tilstand for adresse {Address}

# Text0023
source: GetRailComDataAsync: Requested RailCom info for loco {locoAddress}
da: GetRailComDataAsync: Anmodede om RailCom-info for lokomotiv {locoAddress}

# Text0024
source: GetRBusDataAsync: Requested R-Bus data for group index {groupIndex}
da: GetRBusDataAsync: Anmodede om R-Bus-data for gruppeindeks {groupIndex}

# Text0025
source: GetSerialtNumberAsync: Requested z21/Z21 serial number
da: GetSerialtNumberAsync: Anmodede om z21/Z21 serienummer

# Text0026
source: GetSystemStateAsync: Requested system state
da: GetSystemStateAsync: Anmodede om systemtilstand

# Text0027
source: GetTurnoutModeAsync: Requested turnout mode for address {address}
da: GetTurnoutModeAsync: Anmodede om sporskifte-tilstand for adresse {address}

# Text0028
source: GetZ21CodeAsync: Requested z21/Z21 (feature) code
da: GetZ21CodeAsync: Anmodede om z21/Z21 (funktions) kode

# Text0029
source: Set loco drive for address {Address}: Speed={Speed}, rocoValue={rocoValue} NativeSteps={NativeSpeedSteps}, Direction={Direction}
da: Indstiller lokomotivkørsel for adresse {Address}: Hastighed={Speed}, rocoVærdi={rocoValue} NativeSteps={NativeSpeedSteps}, Retning={Direction}

# Text0030
source: Toggle function {functionIndex} for loco address {address}
da: Skifter funktion {functionIndex} for lokomotiv-adresse {address}

# Text0031
source: Setting loco mode for address {Address} to {Mode}
da: Indstiller lokomotiv-tilstand for adresse {Address} til {Mode}

# Text0032
source: Sending Emergency Stop command.
da: Sender Nødstop-kommando.

# Text0033
source: Setting turnout mode for address {Address} to {Mode}
da: Indstiller sporskifte-tilstand for adresse {Address} til {Mode}

# Text0034
source: Setting turnout position address {address}, position {position}
da: Indstiller sporskifte-position for adresse {address}, position {position}

# Text0035
source: Setting track power off
da: Slår skinnespænding fra

# Text0036
source: Setting track power on
da: Slår skinnespænding til

# Text0037
source: An exception occurred during ping to {Host}.
da: Der opstod en undtagelse under ping til {Host}.

# Text0038
source: Sending keep-alive message to Z21.
da: Sender keep-alive-besked til Z21.

# Text0039
source: Requesting RailCom data from next locomotive in ring buffer
da: Anmoder om RailCom-data fra næste lokomotiv i ringbuffer

# Text0040
source: Connection to Z21 lost. No response to multiple pings.
da: Forbindelse til Z21 tabt. Intet svar på flere pings.

# Text0041
source: No message received from Z21 for a while. Pinging to check connection...
da: Ingen besked modtaget fra Z21 i et stykke tid. Pinger for at tjekke forbindelsen...

# Text0042
source: Ping successful, Z21 is still on the network. Waiting for data.
da: Ping lykkedes, Z21 er stadig på netværket. Venter på data.

# Text0043
source: Ping failed. Failure count: {Count}
da: Ping mislykkedes. Antal fejl: {Count}

# Text0044
source: An exception occurred during watchdog ping. Failure count: {Count}
da: Der opstod en undtagelse under watchdog-ping. Antal fejl: {Count}

# Text0045
source: Cannot send command. Client is not connected.
da: Kan ikke sende kommando. Klienten er ikke tilsluttet.

# Text0046
source: Failed to send command to central station. Exception: {message}
da: Kunne ikke sende kommando til centralstationen. Fejl opstået: {message}

# Text0047
source: An error occurred in the receive loop. Exception: {message}
da: Der opstod en fejl i modtagelses-løkken. Fejl opstået: {message}

# Text0048
source: Received malformed data: not enough bytes to read message length. Remaining bytes: {Length}
da: Modtog forkert formateret data: ikke nok bytes til at læse beskedlængde. Resterende bytes: {Length}

# Text0049
source: Encountered zero-length message in data stream. Stopping parse of this packet.
da: Stødte på besked med længde nul i datastrøm. Stopper tolkning af denne pakke.

# Text0050
source: Received malformed data: buffer is smaller than the indicated message length. Expected: {Expected}, Actual remaining: {Actual}
da: Modtog forkert formateret data: buffer er mindre end den angivne beskedlængde. Forventet: {Expected}, Faktisk resterende: {Actual}

# Text0051
source: Received an unhandled or malformed packet. Header: 0x{Header:X4}, Length: {Length}
da: Modtog en uhåndteret eller forkert formateret pakke. Header: 0x{Header:X4}, Længde: {Length}

# Text0052
source: Received Loco Slot Info packet is too short. Expected at least 24 bytes, got {Length}
da: Modtaget 'Loco Slot Info'-pakke er for kort. Forventede mindst 24 bytes, fik {Length}

# Text0053
source: Loco Slot Info for slot {SlotNumber} received: Address={Address}
da: Lokomotiv Slot Info for slot {SlotNumber} modtaget: Adresse={Address}

# Text0054
source: Send an unknown X-Bus command to Z21
da: Sendte en ukendt X-Bus-kommando til Z21

# Text0055
source: Received an unhandled X-Bus command with X-Header: 0x{XHeader:X2}
da: Modtog en uhåndteret X-Bus-kommando med X-Header: 0x{XHeader:X2}

# Text0056
source: RailCom data for loco {Address} received.
da: RailCom-data for lokomotiv {Address} modtaget.

# Text0057
source: Z21 Code received: {LockState}
da: Z21 Kode modtaget: {LockState}

# Text0058
source: R-Bus data for group {GroupIndex} received.
da: R-Bus-data for gruppe {GroupIndex} modtaget.

# Text0059
source: Turnout Mode for address {Address} received: {Mode}
da: Sporskifte-tilstand for adresse {Address} modtaget: {Mode}

# Text0060
source: Received Emergency stop packet is too short. Expected 7 bytes, got {Length}
da: Modtaget nødstop-pakke er for kort. Forventede 7 bytes, fik {Length}

# Text0061
source: Received Emergency stop packet with invalid checksum. Received: 0x{Received:X2}, Calculated: 0x{Calculated:X2}. Packet discarded.
da: Modtaget nødstop-pakke med ugyldig kontrolsum. Modtaget: 0x{Received:X2}, Beregnet: 0x{Calculated:X2}. Pakke kasseret.

# Text0062
source: Emergency stop received
da: Nødstop modtaget

# Text0063
source: Received Turnout Info packet is too short. Expected 9 bytes, got {Length}
da: Modtaget sporskifte-info-pakke er for kort. Forventede 9 bytes, fik {Length}

# Text0064
source: Received Turnout Info packet with invalid checksum. Received: 0x{Received:X2}, Calculated: 0x{Calculated:X2}. Packet discarded.
da: Modtaget sporskifte-info-pakke med ugyldig kontrolsum. Modtaget: 0x{Received:X2}, Beregnet: 0x{Calculated:X2}. Pakke kasseret.

# Text0065
source: Turnout Info for address {Address} received: {State}
da: Sporskifte-info for adresse {Address} modtaget: {State}

# Text0066
source: Received Track Power Info packet is too short. Expected 7 bytes, got {Length}
da: Modtaget skinnespændings-info-pakke er for kort. Forventede 7 bytes, fik {Length}

# Text0067
source: Received Track Power Info packet with invalid checksum. Received: 0x{Received:X2}, Calculated: 0x{Calculated:X2}. Packet discarded.
da: Modtaget skinnespændings-info-pakke med ugyldig kontrolsum. Modtaget: 0x{Received:X2}, Beregnet: 0x{Calculated:X2}. Pakke kasseret.

# Text0068
source: Track Power State received: {trackPowerInfo}
da: Skinnespændings-tilstand modtaget: {trackPowerInfo}

# Text0069
source: Serial Number received: {SerialNumber}
da: Serienummer modtaget: {SerialNumber}

# Text0070
source: Hardware Info received: {HWType}, Firmware: {FWVersion}
da: Hardware-info modtaget: {HWType}, Firmware: {FWVersion}

# Text0071
source: Failed to parse firmware version from LAN_GET_HWINFO response.
da: Kunne ikke tolke firmwareversion fra LAN_GET_HWINFO-svar.

# Text0072
source: Firmware bug workaround: Combined LocoInfo and LocoMode for address {Address} and raised event.
da: Firmware-fejl-omgåelse: Kombinerede lokomotiv-info og lokomotiv-tilstand for adresse {Address} og udløste hændelse.

# Text0073
source: Loco Mode for address {Address} received: {Mode}
da: Lokomotiv-tilstand for adresse {Address} modtaget: {Mode}

# Text0074
source: Broadcast flags received and processed. Flags: 0x{Flags:X8}
da: Broadcast-flag modtaget og behandlet. Flag: 0x{Flags:X8}

# Text0075
source: Received Loco Info packet is too short. Expected at least {Length} bytes, got {ActualLength}
da: Modtaget lokomotiv-info-pakke er for kort. Forventede mindst {Length} bytes, fik {ActualLength}

# Text0076
source: Received Loco Info packet with invalid checksum. Received: 0x{Received:X2}, Calculated: 0x{Calculated:X2}. Packet discarded.
da: Modtaget lokomotiv-info-pakke med ugyldig kontrolsum. Modtaget: 0x{Received:X2}, Beregnet: 0x{Calculated:X2}. Pakke kasseret.

# Text0077
source: Firmware bug workaround: Stored partial LocoInfo for address {Address}, awaiting LocoMode.
da: Firmware-fejl-omgåelse: Gemte delvis lokomotiv-info for adresse {Address}, afventer lokomotiv-tilstand.

# Text0078
source: Loco Info for address {Address} received and processed.
da: Lokomotiv-info for adresse {Address} modtaget og behandlet.

# Text0079
source: Firmware version received and processed: {Version}
da: Firmwareversion modtaget og behandlet: {Version}

# Text0080
source: Failed to parse firmware version from received data.
da: Kunne ikke tolke firmwareversion fra modtaget data.

# Text0081
source: System state packet is too short. Expected at least 18 bytes, got {Length}
da: Systemtilstands-pakke er for kort. Forventede mindst 18 bytes, fik {Length}

# Text0082
source: System state received and successfully processed. Internal voltage: {volt} mV.
da: Systemtilstand modtaget og behandlet. Intern spænding: {volt} mV

# Text0083
source: Setting broadcast flags to {subscripedBroadcastFlags}
da: Indstiller broadcast-flag til {subscripedBroadcastFlags}

# Text0084
source: GetLocoSlotInfoAsync: Requested loco info for slot {slotNumber}
da: GetLocoSlotInfoAsync: Efterspurgte lokomotiv information for slot {slotNumber}

# Text0085
source: GetBroadcastFlagsAsync: Requested the broadcast flags
da: GetBroadcastFlagsAsync: Efterspurgte underretningsflagene

# Text0086
source: GetFirmwareVersionAsync: Requested the firmware version
da: GetFirmwareVersionAsync: Efterspurgte firmware version

# Text0087
source: GetHardwareInfoAsync: Requested the hardware information
da: GetHardwareInfoAsync: Efterspurgte hardware information
